﻿//**********************************************************************
//**********************************************************************
//**                                                                  **
//**        (C)Copyright 1992-2020, AAEON Technology Inc.             **
//**                                                                  **
//**                       All Rights Reserved.                       **
//**                                                                  **
//**********************************************************************
//**********************************************************************
/=#
#include "VFR.uni"

#string		STR_IT8625_MISC_CONFIGURATION		#language eng "IT8625 Misc Configuration"

#string		STR_IT8625RESTOREACPOWERLOSS		#language eng "Restore AC Power Loss"
#string		STR_IT8625RESTOREACPOWERLOSS_HELP	#language eng ""
#string		STR_IT8625RESTOREACPOWERLOSS_LASTSTATE	#language eng "Last State"
#string		STR_IT8625RESTOREACPOWERLOSS_ALWAYSON	#language eng "Always On"
#string		STR_IT8625RESTOREACPOWERLOSS_ALWAYSOFF	#language eng "Always Off"
#string		STR_IT8625RESTOREACPOWERLOSS_BYPASS	#language eng "Bypass"

#string		STR_IT8625_SMBUS_SLAVE_0		#language eng "IT8625 SMBUS Slave 0"
#string		STR_IT8625_SMBUS_SLAVE_0_HELP		#language eng "En/Disable IT8625 SMBUS Slave 0 (Pin 76:SCL0/ Pin75:SDA0)"
#string		STR_IT8625_SMBUS_SLAVE_1		#language eng "IT8625 SMBUS Slave 1"
#string		STR_IT8625_SMBUS_SLAVE_1_HELP		#language eng "En/Disable IT8625 SMBUS Slave 1 (Pin116:SCL1/Pin115:SDA1)"

#string		STR_IT8625_MISC_UART_MODE_CFG		#language eng "IT8625 UART Mode Configuration"
#string		STR_IT8625_MISC_UART_MODE_CFG_HELP	#language eng "IT8625 UART Mode Configuration Setup Form"
#string		STR_IT8625_SERIAL_PORT_1		#language eng "IT8625 Serial Port 1"
#string		STR_IT8625_SERIAL_PORT_2		#language eng "IT8625 Serial Port 2"
#string		STR_IT8625_UART_IRQ_TYPE		#language eng "  IRQ Type"
#string		STR_IT8625_UART_IRQ_NORMAL		#language eng "Normal"
#string		STR_IT8625_UART_IRQ_SHARING		#language eng "IRQ sharing"
#string		STR_IT8625_UARTAUTOFLOWCONTROLENABLE	#language eng "  RS485 Auto Flow Control"
#string		STR_IT8625_UART_RTS_INVERT		#language eng "  RTS# Invert"

#string		STR_IT8625_MISC_WDT_CFG			#language eng "IT8625 Watch Dog Configuration"
#string		STR_IT8625_MISC_WDT_CFG_HELP		#language eng "IT8625 Watch Dog Configuration Setup Form"
#string		STR_IT8625_WDT_RSTCONOUT		#language eng "WDT Out through RSTCONOUT (pulse)"
#string		STR_IT8625_WDT_RSTCONOUT_HELP		#language eng "En/Disable WDT Output through RSTCONOUT (pulse)"
#string		STR_IT8625_WDT_TIMEOUT_VAL_SEL		#language eng "WDT Time-out Value Select"
#string		STR_IT8625_WDT_TIMEOUT_VAL_SEL_HELP	#language eng "Select unit of WDT Time-out Value as second or minute"
#string		STR_IT8625_MINUTE			#language eng "Minute"
#string		STR_IT8625_SECOND			#language eng "Second"
#string		STR_IT8625_WDT_KRST			#language eng "WDT Out through KRST (pulse)"
#string		STR_IT8625_WDT_KRST_HELP		#language eng "En/Disable WDT Output through KRST (pulse)"
#string		STR_IT8625_WDT_VAL_EX_SEL		#language eng "WDT Time-out Value Extra Select"
#string		STR_IT8625_WDT_VAL_EX_SEL_HELP		#language eng "Select the WDT Time-out unit\n0: By WDT Time-out Value Select\n1: 62.5ms x WDT Timer-out value"
#string		STR_IT8625_BY_WDT_SEL			#language eng "By WDT Time-out Value Select"
#string		STR_IT8625_62_5_MS_X_WDT_VAL		#language eng "62.5ms x WDT Timer-out value"
#string		STR_IT8625_WDT_PWRGD			#language eng "WDT Out through PWRGD"
#string		STR_IT8625_WDT_PWRGD_HELP		#language eng "En/Disable WDT Output through PWRGD"

#string		STR_IT8625_MISC_GPIO_CFG	#language eng "IT8625 GPIO Configuration"
#string		STR_IT8625_MISC_GPIO_CFG_HELP	#language eng "IT8625 GPIO Configuration Setup Form"

#string		STR_IT8625_GPIO_SE		#language eng "  Simple I/O Enable"
#string		STR_IT8625_GPIO_SE_HELP		#language eng "To select the function as the Simple I/O function or the Alternate function."
#string		STR_IT8625_GPIO_ALTERNATE	#language eng "Alternate"
#string		STR_IT8625_GPIO_SIMPLE_IO	#language eng "Simple I/O"

#string		STR_IT8625_GPIO_OE	#language eng "  Type"
#string		STR_IT8625_GPIO_INPUT	#language eng "Input"
#string		STR_IT8625_GPIO_OUTPUT	#language eng "Output"

#string		STR_IT8625_GPIO_VAL	#language eng "  Level"
#string		STR_IT8625_GPIO_LOW	#language eng "Low"
#string		STR_IT8625_GPIO_HIGH	#language eng "High"

#string		STR_IT8625_GPIO_IPU		#language eng "  Internal Pull-up"
#string		STR_IT8625_GPIO_IPU_HELP	#language eng "For GP2x, GP43, GP53, GP54, GP62, GP90, GPA4, GPA5 and GPA6, internal pull-up is not supported."

#string		STR_IT8625_GPIO10	#language eng "GPIO10"
#string		STR_IT8625_GPIO11	#language eng "GPIO11"
#string		STR_IT8625_GPIO12	#language eng "GPIO12"
#string		STR_IT8625_GPIO13	#language eng "GPIO13"
#string		STR_IT8625_GPIO14	#language eng "GPIO14"
#string		STR_IT8625_GPIO15	#language eng "GPIO15"
#string		STR_IT8625_GPIO16	#language eng "GPIO16"
#string		STR_IT8625_GPIO17	#language eng "GPIO17"

#string		STR_IT8625_GPIO20	#language eng "GPIO20"
#string		STR_IT8625_GPIO21	#language eng "GPIO21"
#string		STR_IT8625_GPIO22	#language eng "GPIO22"
#string		STR_IT8625_GPIO23	#language eng "GPIO23"
#string		STR_IT8625_GPIO24	#language eng "GPIO24"
#string		STR_IT8625_GPIO25	#language eng "GPIO25"
#string		STR_IT8625_GPIO26	#language eng "GPIO26"
#string		STR_IT8625_GPIO27	#language eng "GPIO27"

#string		STR_IT8625_GPIO30	#language eng "GPIO30"
#string		STR_IT8625_GPIO31	#language eng "GPIO31"
#string		STR_IT8625_GPIO32	#language eng "GPIO32"
#string		STR_IT8625_GPIO33	#language eng "GPIO33"
#string		STR_IT8625_GPIO34	#language eng "GPIO34"
#string		STR_IT8625_GPIO35	#language eng "GPIO35"
#string		STR_IT8625_GPIO36	#language eng "GPIO36"
#string		STR_IT8625_GPIO37	#language eng "GPIO37"

#string		STR_IT8625_GPIO40	#language eng "GPIO40"
#string		STR_IT8625_GPIO41	#language eng "GPIO41"
#string		STR_IT8625_GPIO42	#language eng "GPIO42"
#string		STR_IT8625_GPIO43	#language eng "GPIO43"
#string		STR_IT8625_GPIO44	#language eng "GPIO44"
#string		STR_IT8625_GPIO45	#language eng "GPIO45"
#string		STR_IT8625_GPIO46	#language eng "GPIO46"
#string		STR_IT8625_GPIO47	#language eng "GPIO47"

#string		STR_IT8625_GPIO50	#language eng "GPIO50"
#string		STR_IT8625_GPIO51	#language eng "GPIO51"
#string		STR_IT8625_GPIO52	#language eng "GPIO52"
#string		STR_IT8625_GPIO53	#language eng "GPIO53"
#string		STR_IT8625_GPIO54	#language eng "GPIO54"
#string		STR_IT8625_GPIO55	#language eng "GPIO55"
#string		STR_IT8625_GPIO56	#language eng "GPIO56"
#string		STR_IT8625_GPIO57	#language eng "GPIO57"

#string		STR_IT8625_GPIO60	#language eng "GPIO60"
#string		STR_IT8625_GPIO61	#language eng "GPIO61"
#string		STR_IT8625_GPIO62	#language eng "GPIO62"
#string		STR_IT8625_GPIO63	#language eng "GPIO63"
#string		STR_IT8625_GPIO64	#language eng "GPIO64"
#string		STR_IT8625_GPIO65	#language eng "GPIO65"
#string		STR_IT8625_GPIO66	#language eng "GPIO66"
#string		STR_IT8625_GPIO67	#language eng "GPIO67"

#string		STR_IT8625_GPIO70	#language eng "GPIO70"
#string		STR_IT8625_GPIO71	#language eng "GPIO71"
#string		STR_IT8625_GPIO72	#language eng "GPIO72"
#string		STR_IT8625_GPIO73	#language eng "GPIO73"
#string		STR_IT8625_GPIO74	#language eng "GPIO74"
#string		STR_IT8625_GPIO75	#language eng "GPIO75"
#string		STR_IT8625_GPIO76	#language eng "GPIO76"
#string		STR_IT8625_GPIO77	#language eng "GPIO77"

#string		STR_IT8625_GPIO80	#language eng "GPIO80"
#string		STR_IT8625_GPIO81	#language eng "GPIO81"
#string		STR_IT8625_GPIO82	#language eng "GPIO82"
#string		STR_IT8625_GPIO83	#language eng "GPIO83"
#string		STR_IT8625_GPIO84	#language eng "GPIO84"
#string		STR_IT8625_GPIO85	#language eng "GPIO85"
#string		STR_IT8625_GPIO86	#language eng "GPIO86"
#string		STR_IT8625_GPIO87	#language eng "GPIO87"

#string		STR_IT8625_GPIO90	#language eng "GPIO90"
#string		STR_IT8625_GPIO91	#language eng "GPIO91"
#string		STR_IT8625_GPIO92	#language eng "GPIO92"
#string		STR_IT8625_GPIO93	#language eng "GPIO93"
#string		STR_IT8625_GPIO94	#language eng "GPIO94"
#string		STR_IT8625_GPIO95	#language eng "GPIO95"
#string		STR_IT8625_GPIO96	#language eng "GPIO96"
#string		STR_IT8625_GPIO97	#language eng "GPIO97"

#string		STR_IT8625_GPIOA0	#language eng "GPIOA0"
#string		STR_IT8625_GPIOA1	#language eng "GPIOA1"
#string		STR_IT8625_GPIOA2	#language eng "GPIOA2"
#string		STR_IT8625_GPIOA3	#language eng "GPIOA3"
#string		STR_IT8625_GPIOA4	#language eng "GPIOA4"
#string		STR_IT8625_GPIOA5	#language eng "GPIOA5"
#string		STR_IT8625_GPIOA6	#language eng "GPIOA6"
#string		STR_IT8625_GPIOA7	#language eng "GPIOA7"

#string		STR_IT8625_MISC_GP_LED_CFG		#language eng "IT8625 GP LED Configuration"
#string		STR_IT8625_MISC_GP_LED_CFG_HELP		#language eng "IT8625 GP LED Configuration Setup Form"
#string		STR_IT8625_MISC_GP_LED1_LOCATION	#language eng "GP LED Blinking 1 Location"
#string		STR_IT8625_MISC_GP_LED1_LOCATION_HELP	#language eng "Define GP LED Blinking 1 Location\nPlease refer to Table 8-13 Location Mapping Table on IT8625 datasheet."
#string		STR_IT8625_GP_LED1_OUT_LOW		#language eng "GP LED Blinking 1 Output Low"
#string		STR_IT8625_GP_LED1_OUT_LOW_HELP		#language eng "Set the GP LED Blinking 1 Output Polarity."
#string		STR_IT8625_GP_LED1_FREQ_CTRL		#language eng "GP LED 1 Frequency Control"
#string		STR_IT8625_GP_LED1_FREQ_CTRL_HELP	#language eng "Set the GP LED 1 Blink frequency & Duty"
#string		STR_IT8625_MISC_GP_LED2_LOCATION	#language eng "GP LED Blinking 2 Location"
#string		STR_IT8625_MISC_GP_LED2_LOCATION_HELP	#language eng "Define GP LED Blinking 2 Location\nPlease refer to Table 8-13 Location Mapping Table on IT8625 datasheet."
#string		STR_IT8625_GP_LED2_OUT_LOW		#language eng "GP LED Blinking 2 Output Low"
#string		STR_IT8625_GP_LED2_OUT_LOW_HELP		#language eng "Set the GP LED Blinking 2 Output Polarity."
#string		STR_IT8625_GP_LED2_FREQ_CTRL		#language eng "GP LED 2 Frequency Control"
#string		STR_IT8625_GP_LED2_FREQ_CTRL_HELP	#language eng "Set the GP LED 2 Blink frequency & Duty"
#string		STR_IT8625_GP_LED_4HZ_50DUTY		#language eng "4Hz, 50% Duty"
#string		STR_IT8625_GP_LED_1HZ_50DUTY		#language eng "1Hz, 50% Duty"
#string		STR_IT8625_GP_LED_0_25HZ_50DUTY		#language eng "0.25Hz, 50% Duty"
#string		STR_IT8625_GP_LED_2HZ_50DUTY		#language eng "2Hz, 50% Duty"
#string		STR_IT8625_GP_LED_0_25HZ_25DUTY		#language eng "0.25Hz, 25% Duty"
#string		STR_IT8625_GP_LED_0_25HZ_75DUTY		#language eng "0.25Hz, 75% Duty"
#string		STR_IT8625_GP_LED_0_125HZ_25DUTY	#language eng "0.125Hz, 25% Duty"
#string		STR_IT8625_GP_LED_0_125HZ_75DUTY	#language eng "0.125Hz, 75% Duty"
#string		STR_IT8625_GP_LED_0_4HZ_20DUTY		#language eng "0.4Hz, 20% Duty"
#string		STR_IT8625_GP_LED_0_5HZ_50DUTY		#language eng "0.5Hz, 50% Duty"
#string		STR_IT8625_GP_LED_0_125HZ_50DUTY	#language eng "0.125Hz, 50% Duty"

#string		STR_IT8625_COMMON_ENABLED		#language eng "Enabled"
#string		STR_IT8625_COMMON_DISABLED		#language eng "Disabled"

//**********************************************************************
//**********************************************************************
//**                                                                  **
//**        (C)Copyright 1992-2020, AAEON Technology Inc.             **
//**                                                                  **
//**                       All Rights Reserved.                       **
//**                                                                  **
//**********************************************************************
//**********************************************************************
